RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_pwm.c
    /* Select local force signal */
    base->SM[subModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_FORCE_SEL_MASK;
    /* Issue a local Force trigger event */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
    /* Restore the source of FORCE OUTPUT signal */
    base->SM[subModule].CTRL2 = reg;
}

/*!
 * brief This function set the output state of the PWM pin as requested for the current cycle.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param pwmChannel         PWM channel to configure
 * param outputstate        Set pwm output state, see @ref pwm_output_state_t.
 */
void PWM_SetChannelOutput(PWM_Type *base,
                          pwm_submodule_t subModule,
                          pwm_channels_t pwmChannel,
                          pwm_output_state_t outputstate)
{
    uint16_t mask, swcout, sourceShift;
    uint16_t reg = base->SM[subModule].CTRL2;

    if (kPWM_PwmA == pwmChannel)
    {
        mask        = PWM_MASK_MASKA(0x01UL << (uint8_t)subModule);
        swcout      = (uint16_t)PWM_SWCOUT_SM0OUT23_MASK << ((uint8_t)subModule * 2U);
        sourceShift = PWM_DTSRCSEL_SM0SEL23_SHIFT + ((uint16_t)subModule * 4U);
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        mask        = PWM_MASK_MASKB(0x01UL << (uint8_t)subModule);
        swcout      = (uint16_t)PWM_SWCOUT_SM0OUT45_MASK << ((uint8_t)subModule * 2U);
        sourceShift = PWM_DTSRCSEL_SM0SEL45_SHIFT + ((uint16_t)subModule * 4U);
    }
    else
    {
        mask        = PWM_MASK_MASKX(0x01UL << (uint8_t)subModule);
        swcout      = 0U;
        sourceShift = 0U;
    }

    if (kPWM_MaskState == outputstate)
    {
        /* Disables the channel output, forcing output level to 0 */
        base->MASK |= mask;
    }
    else
    {
        /* Enables the channel output first */
        base->MASK &= ~mask;
        /* PwmX only support MASK mode */
        if (kPWM_PwmX != pwmChannel)
        {
            if (kPWM_HighState == outputstate)
            {
                base->SWCOUT |= swcout;
                base->DTSRCSEL =
                    (base->DTSRCSEL & ~(uint16_t)(0x3UL << sourceShift)) | (uint16_t)(0x2UL << sourceShift);
            }
            else if (kPWM_LowState == outputstate)
            {
                base->SWCOUT &= ~swcout;
                base->DTSRCSEL =
                    (base->DTSRCSEL & ~(uint16_t)(0x3UL << sourceShift)) | (uint16_t)(0x2UL << sourceShift);
            }
            else if (kPWM_NormalState == outputstate)
            {
                base->DTSRCSEL &= ~(uint16_t)(0x3UL << sourceShift);
            }
            else
            {
                base->DTSRCSEL =
                    (base->DTSRCSEL & ~(uint16_t)(0x3UL << sourceShift)) | (uint16_t)(0x1UL << sourceShift);
            }
        }
    }

    /* Select local force signal */
    base->SM[subModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_FORCE_SEL_MASK;
    /* Issue a local Force trigger event */
    base->SM[subModule].CTRL2 |= PWM_CTRL2_FORCE_MASK;
    /* Restore the source of FORCE OUTPUT signal */
    base->SM[subModule].CTRL2 = reg;
}

#if defined(FSL_FEATURE_PWM_HAS_PHASE_DELAY) && FSL_FEATURE_PWM_HAS_PHASE_DELAY
/*!
 * brief This function set the phase delay from the master sync signal of submodule 0.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param pwmChannel         PWM channel to configure
 * param delayCycles        Number of cycles delayed from submodule 0.
 *
 * return kStatus_Fail if the number of delay cycles is set larger than the period defined in submodule 0;
 *        kStatus_Success if set phase delay success
 */
status_t PWM_SetPhaseDelay(PWM_Type *base, pwm_channels_t pwmChannel, pwm_submodule_t subModule, uint16_t delayCycles)
{
    assert(subModule != kPWM_Module_0);
    uint16_t reg = base->SM[subModule].CTRL2;
    
    /* Clear LDOK bit if it is set */
    if (0U != (base->MCTRL & PWM_MCTRL_LDOK(1UL << (uint8_t)subModule)))
    {
        base->MCTRL |= PWM_MCTRL_CLDOK(1UL << (uint8_t)subModule);
    }
    
    if(base->SM[kPWM_Module_0].VAL1 < delayCycles)
    {
        return kStatus_Fail;
    }
    else
    {
        base->SM[subModule].PHASEDLY = delayCycles;
    }
    
    /* Select the master sync signal as the source for initialization */
    reg = (reg & ~(uint16_t)PWM_CTRL2_INIT_SEL_MASK)| PWM_CTRL2_INIT_SEL(2);
    /* Set Load mode to make Buffered registers take effect immediately when LDOK bit set */
    base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;
    /* Set LDOK bit to load buffer registers */
    base->MCTRL |= PWM_MCTRL_LDOK(1UL << (uint8_t)subModule);
    /* Restore the source of phase delay register intialization */
    base->SM[subModule].CTRL2 = reg;
    return kStatus_Success;
}
#endif /* FSL_FEATURE_PWM_HAS_PHASE_DELAY */